###################################################################

# Created by write_sdc on Sun Nov 17 14:37:57 2024

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_fanout 4 [current_design]
set_max_area 0
set_driving_cell -lib_cell INVX1TS [get_ports {inputX[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputX[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputX[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputX[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputX[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputX[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputX[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputX[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputX[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputX[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputX[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputX[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputX[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputX[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputX[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputX[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputB[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputB[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputB[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputB[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputB[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputB[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputB[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputB[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputB[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputB[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputB[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputB[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputB[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputB[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputB[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {inputB[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[38]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[37]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[36]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[35]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[34]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[33]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[32]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[31]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[30]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[29]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[28]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[27]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[26]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[25]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[24]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[23]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[22]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[21]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[20]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[19]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[18]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[17]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[16]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {totalSumIn[0]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[38]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[37]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[36]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[35]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[34]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[33]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[32]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[31]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[30]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[29]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[28]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[27]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[26]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[25]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[24]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[23]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[22]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[21]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[20]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[19]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[18]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[17]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[16]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[15]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[14]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[13]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[12]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[11]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[10]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[9]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[8]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[7]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[6]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[5]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[4]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[3]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[2]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[1]}]
set_load -pin_load 0.005 [get_ports {totalSumOut[0]}]
set_max_capacitance 0.005 [get_ports {inputX[15]}]
set_max_capacitance 0.005 [get_ports {inputX[14]}]
set_max_capacitance 0.005 [get_ports {inputX[13]}]
set_max_capacitance 0.005 [get_ports {inputX[12]}]
set_max_capacitance 0.005 [get_ports {inputX[11]}]
set_max_capacitance 0.005 [get_ports {inputX[10]}]
set_max_capacitance 0.005 [get_ports {inputX[9]}]
set_max_capacitance 0.005 [get_ports {inputX[8]}]
set_max_capacitance 0.005 [get_ports {inputX[7]}]
set_max_capacitance 0.005 [get_ports {inputX[6]}]
set_max_capacitance 0.005 [get_ports {inputX[5]}]
set_max_capacitance 0.005 [get_ports {inputX[4]}]
set_max_capacitance 0.005 [get_ports {inputX[3]}]
set_max_capacitance 0.005 [get_ports {inputX[2]}]
set_max_capacitance 0.005 [get_ports {inputX[1]}]
set_max_capacitance 0.005 [get_ports {inputX[0]}]
set_max_capacitance 0.005 [get_ports {inputB[15]}]
set_max_capacitance 0.005 [get_ports {inputB[14]}]
set_max_capacitance 0.005 [get_ports {inputB[13]}]
set_max_capacitance 0.005 [get_ports {inputB[12]}]
set_max_capacitance 0.005 [get_ports {inputB[11]}]
set_max_capacitance 0.005 [get_ports {inputB[10]}]
set_max_capacitance 0.005 [get_ports {inputB[9]}]
set_max_capacitance 0.005 [get_ports {inputB[8]}]
set_max_capacitance 0.005 [get_ports {inputB[7]}]
set_max_capacitance 0.005 [get_ports {inputB[6]}]
set_max_capacitance 0.005 [get_ports {inputB[5]}]
set_max_capacitance 0.005 [get_ports {inputB[4]}]
set_max_capacitance 0.005 [get_ports {inputB[3]}]
set_max_capacitance 0.005 [get_ports {inputB[2]}]
set_max_capacitance 0.005 [get_ports {inputB[1]}]
set_max_capacitance 0.005 [get_ports {inputB[0]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[38]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[37]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[36]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[35]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[34]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[33]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[32]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[31]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[30]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[29]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[28]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[27]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[26]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[25]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[24]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[23]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[22]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[21]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[20]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[19]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[18]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[17]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[16]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[15]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[14]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[13]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[12]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[11]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[10]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[9]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[8]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[7]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[6]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[5]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[4]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[3]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[2]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[1]}]
set_max_capacitance 0.005 [get_ports {totalSumIn[0]}]
set_max_fanout 4 [get_ports {inputX[15]}]
set_max_fanout 4 [get_ports {inputX[14]}]
set_max_fanout 4 [get_ports {inputX[13]}]
set_max_fanout 4 [get_ports {inputX[12]}]
set_max_fanout 4 [get_ports {inputX[11]}]
set_max_fanout 4 [get_ports {inputX[10]}]
set_max_fanout 4 [get_ports {inputX[9]}]
set_max_fanout 4 [get_ports {inputX[8]}]
set_max_fanout 4 [get_ports {inputX[7]}]
set_max_fanout 4 [get_ports {inputX[6]}]
set_max_fanout 4 [get_ports {inputX[5]}]
set_max_fanout 4 [get_ports {inputX[4]}]
set_max_fanout 4 [get_ports {inputX[3]}]
set_max_fanout 4 [get_ports {inputX[2]}]
set_max_fanout 4 [get_ports {inputX[1]}]
set_max_fanout 4 [get_ports {inputX[0]}]
set_max_fanout 4 [get_ports {inputB[15]}]
set_max_fanout 4 [get_ports {inputB[14]}]
set_max_fanout 4 [get_ports {inputB[13]}]
set_max_fanout 4 [get_ports {inputB[12]}]
set_max_fanout 4 [get_ports {inputB[11]}]
set_max_fanout 4 [get_ports {inputB[10]}]
set_max_fanout 4 [get_ports {inputB[9]}]
set_max_fanout 4 [get_ports {inputB[8]}]
set_max_fanout 4 [get_ports {inputB[7]}]
set_max_fanout 4 [get_ports {inputB[6]}]
set_max_fanout 4 [get_ports {inputB[5]}]
set_max_fanout 4 [get_ports {inputB[4]}]
set_max_fanout 4 [get_ports {inputB[3]}]
set_max_fanout 4 [get_ports {inputB[2]}]
set_max_fanout 4 [get_ports {inputB[1]}]
set_max_fanout 4 [get_ports {inputB[0]}]
set_max_fanout 4 [get_ports {totalSumIn[38]}]
set_max_fanout 4 [get_ports {totalSumIn[37]}]
set_max_fanout 4 [get_ports {totalSumIn[36]}]
set_max_fanout 4 [get_ports {totalSumIn[35]}]
set_max_fanout 4 [get_ports {totalSumIn[34]}]
set_max_fanout 4 [get_ports {totalSumIn[33]}]
set_max_fanout 4 [get_ports {totalSumIn[32]}]
set_max_fanout 4 [get_ports {totalSumIn[31]}]
set_max_fanout 4 [get_ports {totalSumIn[30]}]
set_max_fanout 4 [get_ports {totalSumIn[29]}]
set_max_fanout 4 [get_ports {totalSumIn[28]}]
set_max_fanout 4 [get_ports {totalSumIn[27]}]
set_max_fanout 4 [get_ports {totalSumIn[26]}]
set_max_fanout 4 [get_ports {totalSumIn[25]}]
set_max_fanout 4 [get_ports {totalSumIn[24]}]
set_max_fanout 4 [get_ports {totalSumIn[23]}]
set_max_fanout 4 [get_ports {totalSumIn[22]}]
set_max_fanout 4 [get_ports {totalSumIn[21]}]
set_max_fanout 4 [get_ports {totalSumIn[20]}]
set_max_fanout 4 [get_ports {totalSumIn[19]}]
set_max_fanout 4 [get_ports {totalSumIn[18]}]
set_max_fanout 4 [get_ports {totalSumIn[17]}]
set_max_fanout 4 [get_ports {totalSumIn[16]}]
set_max_fanout 4 [get_ports {totalSumIn[15]}]
set_max_fanout 4 [get_ports {totalSumIn[14]}]
set_max_fanout 4 [get_ports {totalSumIn[13]}]
set_max_fanout 4 [get_ports {totalSumIn[12]}]
set_max_fanout 4 [get_ports {totalSumIn[11]}]
set_max_fanout 4 [get_ports {totalSumIn[10]}]
set_max_fanout 4 [get_ports {totalSumIn[9]}]
set_max_fanout 4 [get_ports {totalSumIn[8]}]
set_max_fanout 4 [get_ports {totalSumIn[7]}]
set_max_fanout 4 [get_ports {totalSumIn[6]}]
set_max_fanout 4 [get_ports {totalSumIn[5]}]
set_max_fanout 4 [get_ports {totalSumIn[4]}]
set_max_fanout 4 [get_ports {totalSumIn[3]}]
set_max_fanout 4 [get_ports {totalSumIn[2]}]
set_max_fanout 4 [get_ports {totalSumIn[1]}]
set_max_fanout 4 [get_ports {totalSumIn[0]}]
